nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/driver_examples/queued_spi/polling_flash/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF7 (number 95), U8[1]/SS1
  @{ */
#define BOARD_SPI_FLASH_SS_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SPI_FLASH_SS_PIN 7U              /*!<@brief GPIOF pin index: 7 */
#define BOARD_SPI_FLASH_SS_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name GPIOF0 (number 55), U8[6]/SCLK1
  @{ */
#define BOARD_SPI_FLASH_SCLK_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SPI_FLASH_SCLK_PIN 0U              /*!<@brief GPIOF pin index: 0 */
#define BOARD_SPI_FLASH_SCLK_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOG11 (number 48), U8[5]/MOSI1
  @{ */
#define BOARD_SPI_FLASH_MOSI_GPIO GPIOG           /*!<@brief GPIO device name: GPIOG */
#define BOARD_SPI_FLASH_MOSI_PIN 11U              /*!<@brief GPIOG pin index: 11 */
#define BOARD_SPI_FLASH_MOSI_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name GPIOD7 (number 47), U8[2]/MISO1
  @{ */
#define BOARD_SPI_FLASH_MISO_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_SPI_FLASH_MISO_PIN 7U              /*!<@brief GPIOD pin index: 7 */
#define BOARD_SPI_FLASH_MISO_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
